---
image: pandas.png
title: Pandas_2
subtitle: Data analysis with Pandas
date: '2024-02-16'
categories: [Pandas, Data Analysis, Python]
author: Kunal Khurana
jupyter: python3
toc: True
---

- helps in numerical computing (NumPy, SciPy)
- helps with analytical libraries (scikit-learn, and data visualizatioon, 
- processes data without for loops

# Data structures
- Series
- Data Frames
- index objects

# Functionality
- Reindexing
- Dropping entreies from axis
- indexing, selection, and filtering
- DataFrame selection with loc and iloc
- integer indexing pitfalls
- pitfalls with chained indexing
- artihmetic and data alignment
- arithmetic methods with fill values
- Operations between DataFrame and Series
- Function applicaiton and mapping
- Sorting and Ranking
- Axis indexed with dupicate labels
# Summarizing and Descriptive statistics
- correlation and variance
- unique values, counts, and memberships

## Series

In [1]:
import pandas as pd

import numpy as np

from pandas import Series, DataFrame

In [2]:
obj = pd.Series([4,2, 312, -3])

obj

0      4
1      2
2    312
3     -3
dtype: int64

In [3]:
obj2 = pd.Series([4,2, 312, -3], index = ['a', 'b', 'c', 'd'])

obj2

a      4
b      2
c    312
d     -3
dtype: int64

In [4]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [5]:
obj2[obj2 > 0]

a      4
b      2
c    312
dtype: int64

In [6]:
np.exp(obj2)

a     5.459815e+01
b     7.389056e+00
c    3.161392e+135
d     4.978707e-02
dtype: float64

In [7]:
'b' in obj2

True

In [8]:
'e' in obj2

False

In [9]:
sdata = {'ohio': 232, 'Texas': 332, 'Oregon': 34343}

obj3 = pd.Series(sdata)

obj3

ohio        232
Texas       332
Oregon    34343
dtype: int64

In [10]:
obj3.to_dict()

{'ohio': 232, 'Texas': 332, 'Oregon': 34343}

In [11]:
states = ['California', 'ohio', 'orgeon']

obj4 = pd.Series(sdata, index = states)

obj4

California      NaN
ohio          232.0
orgeon          NaN
dtype: float64

In [12]:
pd.isna(obj4) # is null

California     True
ohio          False
orgeon         True
dtype: bool

In [13]:
pd.notna(obj4)  #not null

California    False
ohio           True
orgeon        False
dtype: bool

In [14]:
obj3 + obj4

California      NaN
Oregon          NaN
Texas           NaN
ohio          464.0
orgeon          NaN
dtype: float64

In [15]:
obj4.name = 'population'

obj4.index.name = 'state'

obj4

state
California      NaN
ohio          232.0
orgeon          NaN
Name: population, dtype: float64

In [16]:
obj

0      4
1      2
2    312
3     -3
dtype: int64

In [17]:
# altering the index in place

obj.index = ['Kunal', 'Rahul', 'Raghav', 'Ryan']

obj

Kunal       4
Rahul       2
Raghav    312
Ryan       -3
dtype: int64

## [DataFrame](https://learning.oreilly.com/library/view/python-for-data/9781098104023/ch05.html#table_dataframe_constructor)

In [18]:
data = {'state': ['ohio', 'ohio', 'nevada',], 
       'year': [2000, 2001, 2002,], 
       'pop': [1.2, 1.3, 1.4,]}

frame = pd.DataFrame(data)

In [19]:
frame

    state  year  pop
0    ohio  2000  1.2
1    ohio  2001  1.3
2  nevada  2002  1.4

In [20]:
frame.head()

    state  year  pop
0    ohio  2000  1.2
1    ohio  2001  1.3
2  nevada  2002  1.4

In [21]:
frame.tail()

    state  year  pop
0    ohio  2000  1.2
1    ohio  2001  1.3
2  nevada  2002  1.4

In [22]:
# passing another column in the dataframe

frame2 = pd.DataFrame(data, columns = ['state', 'year', 'pop', 'debt'])

frame2

    state  year  pop debt
0    ohio  2000  1.2  NaN
1    ohio  2001  1.3  NaN
2  nevada  2002  1.4  NaN

In [24]:
# changing the order of columns


frame2 = pd.DataFrame(data, columns = [ 'year', 'pop', 'debt', 'state'])

In [23]:
frame2

    state  year  pop debt
0    ohio  2000  1.2  NaN
1    ohio  2001  1.3  NaN
2  nevada  2002  1.4  NaN

In [25]:
frame2.year

0    2000
1    2001
2    2002
Name: year, dtype: int64

In [26]:
frame2.loc[1]

year     2001
pop       1.3
debt      NaN
state    ohio
Name: 1, dtype: object

In [27]:
frame2.iloc[2]

year       2002
pop         1.4
debt        NaN
state    nevada
Name: 2, dtype: object

In [28]:
frame2.pop

<bound method DataFrame.pop of    year  pop debt   state
0  2000  1.2  NaN    ohio
1  2001  1.3  NaN    ohio
2  2002  1.4  NaN  nevada>

In [29]:
frame2.year

0    2000
1    2001
2    2002
Name: year, dtype: int64

In [30]:
# assigning values

frame2['debt'] = 14.5

frame2

   year  pop  debt   state
0  2000  1.2  14.5    ohio
1  2001  1.3  14.5    ohio
2  2002  1.4  14.5  nevada

In [31]:
# assiging a new column (resuls in new column if it does not exist before)

frame2['eastern'] = frame2['state']  =='ohio'

frame2

   year  pop  debt   state  eastern
0  2000  1.2  14.5    ohio     True
1  2001  1.3  14.5    ohio     True
2  2002  1.4  14.5  nevada    False

In [32]:
# transposing
frame2.T

            0     1       2
year     2000  2001    2002
pop       1.2   1.3     1.4
debt     14.5  14.5    14.5
state    ohio  ohio  nevada
eastern  True  True   False

In [33]:
pd.DataFrame(data)

    state  year  pop
0    ohio  2000  1.2
1    ohio  2001  1.3
2  nevada  2002  1.4

In [34]:
frame2.index.name = 'year'

In [35]:
frame2.columns.name = 'state'  # starts with state column

In [36]:
frame2

state  year  pop  debt   state  eastern
year
0      2000  1.2  14.5    ohio     True
1      2001  1.3  14.5    ohio     True
2      2002  1.4  14.5  nevada    False

In [37]:
frame2.to_numpy()

array([[2000, 1.2, 14.5, 'ohio', True],
       [2001, 1.3, 14.5, 'ohio', True],
       [2002, 1.4, 14.5, 'nevada', False]], dtype=object)

## [index objects](https://learning.oreilly.com/library/view/python-for-data/9781098104023/ch05.html#table_index_methods)

In [38]:
obj4 = pd.Series(np.arange(3), index = ['a', 'b', 'c'])

index = obj4.index


index

Index(['a', 'b', 'c'], dtype='object')

In [39]:
index [1:]

Index(['b', 'c'], dtype='object')

In [ ]:
# index objects are immutable

index[1]= 'd' #type error

In [41]:
labels = pd.Index(np.arange(3))

labels

Index([0, 1, 2], dtype='int32')

In [42]:
obj2 = pd.Series([1.5, -2.5, 0], index = labels)


obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [43]:
obj2.index is labels

True

In [44]:
frame2

state  year  pop  debt   state  eastern
year
0      2000  1.2  14.5    ohio     True
1      2001  1.3  14.5    ohio     True
2      2002  1.4  14.5  nevada    False

In [45]:
frame2.columns

Index(['year', 'pop', 'debt', 'state', 'eastern'], dtype='object', name='state')

In [46]:
2003 in frame2.index

False

In [47]:
# unlike python, a pandas index can contain duplicate labels

pd.Index (['foo', 'boo', 'bar', 'baa', 'etc', 'foo'])

Index(['foo', 'boo', 'bar', 'baa', 'etc', 'foo'], dtype='object')

## [Reindexing](https://learning.oreilly.com/library/view/python-for-data/9781098104023/ch05.html#table_reindex_function)

In [48]:
obj = pd.Series([4.5,48, -3,2,3.9], index= ['a', 'b', 'c', 'd', 'e'])

obj

a     4.5
b    48.0
c    -3.0
d     2.0
e     3.9
dtype: float64

In [49]:
# reindexing
obj2 = obj.reindex(['b', 'a', 'c', 'd', 'e'])

obj2

b    48.0
a     4.5
c    -3.0
d     2.0
e     3.9
dtype: float64

In [50]:
# time series data fill
obj3 = pd.Series(['blue', 'purple', 'yellow'], index = [0, 2, 4])

obj3

0      blue
2    purple
4    yellow
dtype: object

In [51]:
# forward filling the values using ffill
obj3.reindex(np.arange(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [52]:
# backward fill
obj3.reindex(np.arange(6), method = 'bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [53]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                    index = ['a', 'b', 'c'],
                    columns= ['ohio', 'texas', 'burmingham'])

frame

   ohio  texas  burmingham
a     0      1           2
b     3      4           5
c     6      7           8

In [54]:
frame2 = frame.reindex(index=['a', 'b', 'c', 'd'])

frame2

   ohio  texas  burmingham
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0
d   NaN    NaN         NaN

In [55]:
# reindexing columns with column keyword

states = ['london', 'texus', 'surrey']

frame.reindex(columns = states)

   london  texus  surrey
a     NaN    NaN     NaN
b     NaN    NaN     NaN
c     NaN    NaN     NaN

## Dropping entries from Axis

In [56]:
obj = pd.Series(np.arange(5.), index = ['a', 'b', 'c', 'd', 'e'])

obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [57]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [58]:
obj.drop(['d', 'e'])

a    0.0
b    1.0
c    2.0
dtype: float64

In [59]:
# in DataFrame
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index=['québec', 'montréal', 'toronto', 'sainte-anne'],
                    columns = ['one', 'two', 'three', 'four'])
data

             one  two  three  four
québec         0    1      2     3
montréal       4    5      6     7
toronto        8    9     10    11
sainte-anne   12   13     14    15

In [60]:
# using drop method
data.drop(index=['toronto', 'sainte-anne'])

          one  two  three  four
québec      0    1      2     3
montréal    4    5      6     7

In [61]:
# dropping using axis method (axis = 1 = columns)

data.drop('two', axis=1)

             one  three  four
québec         0      2     3
montréal       4      6     7
toronto        8     10    11
sainte-anne   12     14    15

In [62]:
data.drop(['three', 'four'], axis='columns')

             one  two
québec         0    1
montréal       4    5
toronto        8    9
sainte-anne   12   13

## Indexing, Selecting, and Filtering

In [63]:
obj = pd.Series(np.arange(4.), index= ['a', 'b', 'c', 'd'])

obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [64]:
obj['b']

1.0

In [65]:
obj[1]

1.0

In [66]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [67]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [68]:
obj.loc[['b', 'c']]

b    1.0
c    2.0
dtype: float64

In [69]:
obj1 = pd.Series([1,2,3], index = [2,0,1])

obj2 = pd.Series([1,2,3], index = ['a', 'b', 'c'])

obj1

2    1
0    2
1    3
dtype: int64

In [70]:
obj2

a    1
b    2
c    3
dtype: int64

In [ ]:
# loc fails as index doesnot contain integers
obj2.loc[[0, 1]]

In [72]:
# fix this

obj2.loc['b':'c']

b    2
c    3
dtype: int64

In [73]:
# so, prefer using iloc with integers

obj1.iloc[[0,1,2]]

2    1
0    2
1    3
dtype: int64

In [74]:
obj2.iloc[[0,1,2]]

a    1
b    2
c    3
dtype: int64

In [75]:
# assigning values

obj2.loc['b':'c'] = 5

obj2

a    1
b    5
c    5
dtype: int64

In [76]:
data

             one  two  three  four
québec         0    1      2     3
montréal       4    5      6     7
toronto        8    9     10    11
sainte-anne   12   13     14    15

In [77]:
data[:2]

          one  two  three  four
québec      0    1      2     3
montréal    4    5      6     7

In [78]:
# booleans
data < 5

               one    two  three   four
québec        True   True   True   True
montréal      True  False  False  False
toronto      False  False  False  False
sainte-anne  False  False  False  False

In [79]:
# assigning values
data[data < 5] = 0

data

             one  two  three  four
québec         0    0      0     0
montréal       0    5      6     7
toronto        8    9     10    11
sainte-anne   12   13     14    15

## [selection of DataFrame with loc and iloc](https://learning.oreilly.com/library/view/python-for-data/9781098104023/ch05.html#table_dataframe_loc_iloc)

In [80]:


data

             one  two  three  four
québec         0    0      0     0
montréal       0    5      6     7
toronto        8    9     10    11
sainte-anne   12   13     14    15

In [81]:
data.loc['montréal']

one      0
two      5
three    6
four     7
Name: montréal, dtype: int32

In [82]:
data.loc[['montréal', 'québec']]

          one  two  three  four
montréal    0    5      6     7
québec      0    0      0     0

In [83]:
data.loc['montréal', ['two', 'three']]

two      5
three    6
Name: montréal, dtype: int32

In [84]:
# similar operations with iloc
data.iloc[2]

one       8
two       9
three    10
four     11
Name: toronto, dtype: int32

In [85]:
data.iloc[[2,1]]  #third row and second row

          one  two  three  four
toronto     8    9     10    11
montréal    0    5      6     7

In [86]:
data.iloc[2,[3,0,1]] #third row (three elements in order)

four    11
one      8
two      9
Name: toronto, dtype: int32

In [87]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
montréal     7    0    5
toronto     11    8    9

## integer indexing pitfalls

In [88]:
series = pd.Series(np.arange(3.))

In [89]:
series

0    0.0
1    1.0
2    2.0
dtype: float64

In [ ]:
# fails here but works fine with iloc and loc 
series[-1]



# value error; key error: -1

In [90]:
series.iloc[-1]

2.0

In [92]:
# non-integer doesnot do this ambiguity

series2 = pd.Series(np.arange(3.0), index = ['a', 'b', 'c'])

In [93]:
series2[-1]

2.0

## Pitfalls with chained indexing

In [94]:
data.loc[:, 'one'] = 1

data

             one  two  three  four
québec         1    0      0     0
montréal       1    5      6     7
toronto        1    9     10    11
sainte-anne    1   13     14    15

In [95]:
data.iloc[2] = 5

In [96]:
data

             one  two  three  four
québec         1    0      0     0
montréal       1    5      6     7
toronto        5    5      5     5
sainte-anne    1   13     14    15

In [97]:
data.loc[data['four'] > 5]  = 3

data

             one  two  three  four
québec         1    0      0     0
montréal       3    3      3     3
toronto        5    5      5     5
sainte-anne    3    3      3     3

In [98]:
# the data gets modified, but it is not the way that was asked for

# fixing it with loc operation

data.loc[data.three == 10, "three"] = 9

data

             one  two  three  four
québec         1    0      0     0
montréal       3    3      3     3
toronto        5    5      5     5
sainte-anne    3    3      3     3

## Arithmetic and Data Alignment

In [99]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index = ['a', 'c', 'd', 'e'])

s2 = pd.Series([1.2, -3, -.3, -.33, -43.2], index = ['e', 'j', 'o', 't', 'y'])

s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [100]:
s2

e     1.20
j    -3.00
o    -0.30
t    -0.33
y   -43.20
dtype: float64

In [101]:
# adding these- missing values donot overlap

s1+s2

a    NaN
c    NaN
d    NaN
e    2.7
j    NaN
o    NaN
t    NaN
y    NaN
dtype: float64

In [102]:
# in case of DataFrame, alignment is performed on both rows and columns

df1 = pd.DataFrame(np.arange(9.).reshape((3,3)), 
                  columns = list('abc'),
                  index = ['ferozpur', 'faridkot', 'montréal'])

df2 = pd.DataFrame(np.arange(12.).reshape((4,3)),
                  columns = list('abc'),
                   index = ['faridkot', 'toronto', 'québec', 'montréal'])

In [103]:
df1

            a    b    c
ferozpur  0.0  1.0  2.0
faridkot  3.0  4.0  5.0
montréal  6.0  7.0  8.0

In [104]:
df2

            a     b     c
faridkot  0.0   1.0   2.0
toronto   3.0   4.0   5.0
québec    6.0   7.0   8.0
montréal  9.0  10.0  11.0

In [105]:
df1 + df2  #because the columns were same, it added those numbers

             a     b     c
faridkot   3.0   5.0   7.0
ferozpur   NaN   NaN   NaN
montréal  15.0  17.0  19.0
québec     NaN   NaN   NaN
toronto    NaN   NaN   NaN

In [106]:
# changing columns names will give all NAN (null values)
df3 = pd.DataFrame(np.arange(12.).reshape((4,3)),
                  columns = list('xyz'),
                   index = ['faridkot', 'toronto', 'québec', 'montréal'])

In [107]:
df1 + df3

           a   b   c   x   y   z
faridkot NaN NaN NaN NaN NaN NaN
ferozpur NaN NaN NaN NaN NaN NaN
montréal NaN NaN NaN NaN NaN NaN
québec   NaN NaN NaN NaN NaN NaN
toronto  NaN NaN NaN NaN NaN NaN

## Arithmetic methods with fill values

In [108]:
df2

            a     b     c
faridkot  0.0   1.0   2.0
toronto   3.0   4.0   5.0
québec    6.0   7.0   8.0
montréal  9.0  10.0  11.0

In [109]:
df2.loc['faridkot', 'y'] = np.nan

In [119]:
df2

            a     b     c   y
faridkot  0.0   1.0   2.0 NaN
toronto   3.0   4.0   5.0 NaN
québec    6.0   7.0   8.0 NaN
montréal  9.0  10.0  11.0 NaN

In [111]:
help(pd.DataFrame._drop_axis)

Help on function _drop_axis in module pandas.core.generic:

_drop_axis(self: 'NDFrameT', labels, axis, level=None, errors: 'IgnoreRaise' = 'raise', only_slice: 'bool_t' = False) -> 'NDFrameT'
    Drop labels from specified axis. Used in the ``drop`` method
    internally.

    Parameters
    ----------
    labels : single label or list-like
    axis : int or axis name
    level : int or level name, default None
        For MultiIndex
    errors : {'ignore', 'raise'}, default 'raise'
        If 'ignore', suppress error and existing labels are dropped.
    only_slice : bool, default False
        Whether indexing along columns should be view-only.

In [ ]:
help(pd.DataFrame.drop)

In [114]:
print(dir(DataFrame))

['T', '_AXIS_LEN', '_AXIS_ORDERS', '_AXIS_TO_AXIS_NUMBER', '_HANDLED_TYPES', '__abs__', '__add__', '__and__', '__annotations__', '__array__', '__array_priority__', '__array_ufunc__', '__bool__', '__class__', '__contains__', '__copy__', '__dataframe__', '__deepcopy__', '__delattr__', '__delitem__', '__dict__', '__dir__', '__divmod__', '__doc__', '__eq__', '__finalize__', '__floordiv__', '__format__', '__ge__', '__getattr__', '__getattribute__', '__getitem__', '__getstate__', '__gt__', '__hash__', '__iadd__', '__iand__', '__ifloordiv__', '__imod__', '__imul__', '__init__', '__init_subclass__', '__invert__', '__ior__', '__ipow__', '__isub__', '__iter__', '__itruediv__', '__ixor__', '__le__', '__len__', '__lt__', '__matmul__', '__mod__', '__module__', '__mul__', '__ne__', '__neg__', '__new__', '__nonzero__', '__or__', '__pos__', '__pow__', '__radd__', '__rand__', '__rdivmod__', '__reduce__', '__reduce_ex__', '__repr__', '__rfloordiv__', '__rmatmul__', '__rmod__', '__rmul__', '__ror__', '__round__', '__rpow__', '__rsub__', '__rtruediv__', '__rxor__', '__setattr__', '__setitem__', '__setstate__', '__sizeof__', '__str__', '__sub__', '__subclasshook__', '__truediv__', '__weakref__', '__xor__', '_accessors', '_accum_func', '_add_numeric_operations', '_agg_examples_doc', '_agg_summary_and_see_also_doc', '_align_frame', '_align_series', '_append', '_arith_method', '_as_manager', '_box_col_values', '_can_fast_transpose', '_check_inplace_and_allows_duplicate_labels', '_check_inplace_setting', '_check_is_chained_assignment_possible', '_check_label_or_level_ambiguity', '_check_setitem_copy', '_clear_item_cache', '_clip_with_one_bound', '_clip_with_scalar', '_cmp_method', '_combine_frame', '_consolidate', '_consolidate_inplace', '_construct_axes_dict', '_construct_result', '_constructor', '_constructor_sliced', '_create_data_for_split_and_tight_to_dict', '_data', '_dir_additions', '_dir_deletions', '_dispatch_frame_op', '_drop_axis', '_drop_labels_or_levels', '_ensure_valid_index', '_find_valid_index', '_from_arrays', '_get_agg_axis', '_get_axis', '_get_axis_name', '_get_axis_number', '_get_axis_resolvers', '_get_block_manager_axis', '_get_bool_data', '_get_cleaned_column_resolvers', '_get_column_array', '_get_index_resolvers', '_get_item_cache', '_get_label_or_level_values', '_get_numeric_data', '_get_value', '_getitem_bool_array', '_getitem_multilevel', '_getitem_nocopy', '_gotitem', '_hidden_attrs', '_indexed_same', '_info_axis', '_info_axis_name', '_info_axis_number', '_info_repr', '_init_mgr', '_inplace_method', '_internal_names', '_internal_names_set', '_is_copy', '_is_homogeneous_type', '_is_label_or_level_reference', '_is_label_reference', '_is_level_reference', '_is_mixed_type', '_is_view', '_iset_item', '_iset_item_mgr', '_iset_not_inplace', '_iter_column_arrays', '_ixs', '_join_compat', '_logical_func', '_logical_method', '_maybe_cache_changed', '_maybe_update_cacher', '_metadata', '_min_count_stat_function', '_needs_reindex_multi', '_protect_consolidate', '_reduce', '_reduce_axis1', '_reindex_axes', '_reindex_columns', '_reindex_index', '_reindex_multi', '_reindex_with_indexers', '_rename', '_replace_columnwise', '_repr_data_resource_', '_repr_fits_horizontal_', '_repr_fits_vertical_', '_repr_html_', '_repr_latex_', '_reset_cache', '_reset_cacher', '_sanitize_column', '_series', '_set_axis', '_set_axis_name', '_set_axis_nocheck', '_set_is_copy', '_set_item', '_set_item_frame_value', '_set_item_mgr', '_set_value', '_setitem_array', '_setitem_frame', '_setitem_slice', '_slice', '_stat_axis', '_stat_axis_name', '_stat_axis_number', '_stat_function', '_stat_function_ddof', '_take', '_take_with_is_copy', '_to_dict_of_blocks', '_to_latex_via_styler', '_typ', '_update_inplace', '_validate_dtype', '_values', '_where', 'abs', 'add', 'add_prefix', 'add_suffix', 'agg', 'aggregate', 'align', 'all', 'any', 'apply', 'applymap', 'asfreq', 'asof', 'assign', 'astype', 'at', 'at_time', 'attrs', 'axes', 'backfill', 'between_time', 'bfill', 'bool', 'boxplot', 'clip', 'columns', 'combine', 'combine_first', 'compare', 'convert_dtypes', 'copy', 'corr', 'corrwith', 'count', 'cov', 'cummax', 'cummin', 'cumprod', 'cumsum', 'describe', 'diff', 'div', 'divide', 'dot', 'drop', 'drop_duplicates', 'droplevel', 'dropna', 'dtypes', 'duplicated', 'empty', 'eq', 'equals', 'eval', 'ewm', 'expanding', 'explode', 'ffill', 'fillna', 'filter', 'first', 'first_valid_index', 'flags', 'floordiv', 'from_dict', 'from_records', 'ge', 'get', 'groupby', 'gt', 'head', 'hist', 'iat', 'idxmax', 'idxmin', 'iloc', 'index', 'infer_objects', 'info', 'insert', 'interpolate', 'isetitem', 'isin', 'isna', 'isnull', 'items', 'iterrows', 'itertuples', 'join', 'keys', 'kurt', 'kurtosis', 'last', 'last_valid_index', 'le', 'loc', 'lt', 'mask', 'max', 'mean', 'median', 'melt', 'memory_usage', 'merge', 'min', 'mod', 'mode', 'mul', 'multiply', 'ndim', 'ne', 'nlargest', 'notna', 'notnull', 'nsmallest', 'nunique', 'pad', 'pct_change', 'pipe', 'pivot', 'pivot_table', 'plot', 'pop', 'pow', 'prod', 'product', 'quantile', 'query', 'radd', 'rank', 'rdiv', 'reindex', 'reindex_like', 'rename', 'rename_axis', 'reorder_levels', 'replace', 'resample', 'reset_index', 'rfloordiv', 'rmod', 'rmul', 'rolling', 'round', 'rpow', 'rsub', 'rtruediv', 'sample', 'select_dtypes', 'sem', 'set_axis', 'set_flags', 'set_index', 'shape', 'shift', 'size', 'skew', 'sort_index', 'sort_values', 'sparse', 'squeeze', 'stack', 'std', 'style', 'sub', 'subtract', 'sum', 'swapaxes', 'swaplevel', 'tail', 'take', 'to_clipboard', 'to_csv', 'to_dict', 'to_excel', 'to_feather', 'to_gbq', 'to_hdf', 'to_html', 'to_json', 'to_latex', 'to_markdown', 'to_numpy', 'to_orc', 'to_parquet', 'to_period', 'to_pickle', 'to_records', 'to_sql', 'to_stata', 'to_string', 'to_timestamp', 'to_xarray', 'to_xml', 'transform', 'transpose', 'truediv', 'truncate', 'tz_convert', 'tz_localize', 'unstack', 'update', 'value_counts', 'values', 'var', 'where', 'xs']

In [ ]:
help(pd.DataFrame.describe)

In [ ]:
help(pd.DataFrame._drop_axis)

In [121]:
df4 = df2

In [122]:
df4

            a     b     c   y
faridkot  0.0   1.0   2.0 NaN
toronto   3.0   4.0   5.0 NaN
québec    6.0   7.0   8.0 NaN
montréal  9.0  10.0  11.0 NaN

In [123]:
df1 + df4

             a     b     c   y
faridkot   3.0   5.0   7.0 NaN
ferozpur   NaN   NaN   NaN NaN
montréal  15.0  17.0  19.0 NaN
québec     NaN   NaN   NaN NaN
toronto    NaN   NaN   NaN NaN

In [124]:
df4.fill_value = 0

df4

            a     b     c   y
faridkot  0.0   1.0   2.0 NaN
toronto   3.0   4.0   5.0 NaN
québec    6.0   7.0   8.0 NaN
montréal  9.0  10.0  11.0 NaN

In [125]:
1/df4

                 a         b         c   y
faridkot       inf  1.000000  0.500000 NaN
toronto   0.333333  0.250000  0.200000 NaN
québec    0.166667  0.142857  0.125000 NaN
montréal  0.111111  0.100000  0.090909 NaN

In [126]:
df4.rdiv(1)

                 a         b         c   y
faridkot       inf  1.000000  0.500000 NaN
toronto   0.333333  0.250000  0.200000 NaN
québec    0.166667  0.142857  0.125000 NaN
montréal  0.111111  0.100000  0.090909 NaN

In [127]:
df4.reindex(columns = df4.columns, fill_value=0) # not working

            a     b     c   y
faridkot  0.0   1.0   2.0 NaN
toronto   3.0   4.0   5.0 NaN
québec    6.0   7.0   8.0 NaN
montréal  9.0  10.0  11.0 NaN

In [128]:
arr = np.arange(12.).reshape((3,4))

arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [ ]:
arr[0]

In [129]:
# broadcasting

arr - arr[0]   #subtracts from all rows

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [130]:
frame

   ohio  texas  burmingham
a     0      1           2
b     3      4           5
c     6      7           8

In [ ]:
help(pd.Series)

In [131]:
series

series1 = pd.Series(data = np.arange(3), index = ['a', 'b', 'c'])

series1

a    0
b    1
c    2
dtype: int32

In [132]:
frame-series1

    a   b  burmingham   c  ohio  texas
a NaN NaN         NaN NaN   NaN    NaN
b NaN NaN         NaN NaN   NaN    NaN
c NaN NaN         NaN NaN   NaN    NaN